Tekla Open API Reference for Tekla Structures 2025
Weld.WeldAttributes.CustomPresentation Property
 Custom presentation GUID to be applied to the weld
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CustomPresentation { get; set; }
Public Property CustomPresentation As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Weld.WeldAttributes Class
Tekla.Structures.Drawing Namespace